
def main():
    pass
    # Цикл по всем файлам в директории с датасетами
       # Цикл по всем электродам в каждом файле
          # Цикл по всем нейронам на электроде
          # Если нейрон - это интернейрон из СА1, то
          # фильтруем ЛПП во всех диапазонах частот
          # Делаем разметку на тета- и нетета-эпохи
          # Находим риппл события
          # ЛПП берется из пирамидного слоя !!!!!
          # Сохраняем все в файл с тем же названием, что и исходный, но в директории preprocessing_1_results


if __name__ == "__main__":
    main()
